import React from "react";
import { Section } from "@/app/ui/math/components/Section";
import { Base_card } from "@/app/ui/math/components/Base_card";
import { Highlight } from "@/app/ui/math/components/Highlight";
import tokenImage from "@/app/[locale]/(app)/linguistics/words/token/assets/img/token.jpeg";
import { Interactive_Image } from "@/app/ui/math/components/Interactive_Image";
import {Quote_with_annotation} from "@/app/ui/math/components/сopywriting/Quote_with_annotation";

export default function Token() {
    return (
        <div className="main_block_task">
            <h1 className="header_h1">Токен</h1>

            {/* Этимология слова "токен" */}
            <Section title="Этимология слова 'Токен'">
                <p className="paragraph">
                    Слово <Highlight>токен</Highlight> пришло из английского языка (<i>token</i>), где оно означает "знак", "символ", "жетон", "предмет, дающий право на что-либо". Этимология этого слова восходит к древнеанглийскому *tācen* (знак или символ). В современном контексте слово "токен" используется в различных технических, экономических и цифровых сферах.
                </p>
                <p className="paragraph">
                    1. <Highlight>Английские корни:</Highlight> Английское слово <i>token</i> изначально обозначало некий предмет или символ, который служил доказательством чего-либо (например, жетон для проезда или символ доверия).
                </p>
                <p className="paragraph">
                    2. <Highlight>Современное использование:</Highlight> В современном русском языке слово "токен" чаще всего встречается в контексте цифровых технологий, криптовалют и безопасности данных, где оно обозначает цифровой объект или инструмент, предоставляющий право на доступ или владение чем-либо.
                </p>
            </Section>

            {/* Интерактивное изображение */}
            <Interactive_Image src={tokenImage} alt={"Токен"} width={500} height={500} />

            {/* Значение слова "токен" */}
            <Section title="Значение слова 'Токен'">
                <p className="paragraph">
                    <Highlight>Токен</Highlight> — это термин, который используется в различных контекстах, и его значение варьируется в зависимости от области применения. В общем смысле, токен — это объект (физический или цифровой), представляющий право на что-либо или используемый для идентификации и аутентификации.
                </p>

                {/* Список значений слова "токен" */}
                <ul className="unordered_list">
                    <li>
                        <Highlight>Токен в криптовалюте:</Highlight> В блокчейн-технологиях токен — это цифровой актив, представляющий право на владение каким-либо ресурсом или активом (например, криптовалютой, цифровым имуществом или услугой).
                        *"Токены могут представлять собой криптовалюту или цифровые активы, такие как NFT."*
                    </li>
                    <li>
                        <Highlight>Токен в безопасности:</Highlight> В области информационной безопасности токен — это уникальная строка данных (ключ или маркер), используемая для аутентификации пользователя или доступа к системе.
                        *"При входе в систему пользователю выдается токен, который подтверждает его подлинность в течение сессии."*
                    </li>
                    <li>
                        <Highlight>Токен в программировании:</Highlight> В программировании токен — это элемент исходного кода, представляющий минимальную значимую единицу языка (например, оператор, ключевое слово или переменную).
                        *"Синтаксический анализатор разбивает код на токены для дальнейшей обработки."*
                    </li>
                    <li>
                        <Highlight>Токен в платежных системах:</Highlight> В электронных платежных системах токен — это временная и безопасная замена реальных данных банковской карты, используемая для проведения транзакций.
                        *"Система токенизации позволяет защитить данные карты при оплате через интернет."*
                    </li>
                    <li>
                        <Highlight>Токен в виде жетона:</Highlight> В традиционном смысле, токен может означать физический предмет, такой как жетон, используемый для получения услуги (например, жетон на метро).
                        *"Жетон на метро является примером физического токена, который позволяет совершить поездку."*
                    </li>
                </ul>
            </Section>

            {/* Примеры использования токенов */}
            <Section title="Примеры использования токенов">
                <ul className="space-y-6">
                    <Base_card
                        title="Токен в блокчейне и криптовалютах"
                        description="В блокчейне токены могут представлять как криптовалюту (например, биткоины), так и цифровые активы, такие как NFT (невзаимозаменяемые токены)."
                        icon="🔗"
                    />
                    <Base_card
                        title="Токенизация данных в платежах"
                        description="Токенизация — это процесс замены чувствительных данных (например, номера карты) уникальным идентификатором — токеном, который можно безопасно передавать между системами."
                        icon="💳"
                    />
                    <Base_card
                        title="Токены для аутентификации"
                        description="В информационных системах токены используются для аутентификации пользователей. После успешного входа в систему пользователю выдается токен, подтверждающий его подлинность на время сессии."
                        icon="🔐"
                    />
                    <Base_card
                        title="Токены в программировании"
                        description="В компиляторах и интерпретаторах токены — это элементарные единицы кода, которые компилятор 'читает' для выполнения программы."
                        icon="💻"
                    />
                    <Base_card
                        title="Токены в виде жетонов"
                        description="В повседневной жизни жетоны используются на мероприятиях, аттракционах или в общественном транспорте. Они представляют собой физические токены, дающие доступ к определенной услуге."
                        icon="🚇"
                    />
                </ul>
            </Section>

            {/* Цитаты о токенах */}
            <Section title="Цитаты о токенах">
                <div className="text-center space-y-8 w-4/5 mx-auto flex flex-col justify-center place-items-center">
                    <Quote_with_annotation
                        quote="Токены — это строительные блоки современной цифровой экономики."
                        annotation="Эта цитата подчеркивает важность токенов в цифровом финансировании и блокчейн-системах."
                    />
                    <Quote_with_annotation
                        quote="Токенизация — будущее безопасных транзакций."
                        annotation="Эта цитата указывает на то, как токенизация повышает безопасность онлайн-платежей и передачи данных."
                    />
                    <Quote_with_annotation
                        quote="Токены представляют переход от традиционных активов к цифровым."
                        annotation="Эта цитата подчеркивает растущую роль токенов в представлении права собственности и активов в цифровом мире."
                    />
                </div>
            </Section>

            {/* Виды токенов */}
            <Section title="Виды токенов">
                <ul className="unordered_list">
                    <li>
                        <Highlight>Токены в криптовалютах:</Highlight>
                        <ul className="unordered_list">
                            <li><Highlight>Финансовые токены:</Highlight> Представляют собой криптовалюту или цифровую валюту, которая может использоваться для платежей или инвестиций (например, биткоины, эфириум).</li>
                            <li><Highlight>Утилитарные токены:</Highlight> Используются для доступа к определенным сервисам или платформам (например, токены для использования децентрализованных приложений).</li>
                            <li><Highlight>NFT (невзаимозаменяемые токены):</Highlight> Уникальные цифровые активы, представляющие право собственности на определенные объекты, такие как цифровое искусство или коллекционные предметы.</li>
                        </ul>
                    </li>
                    <li>
                        <Highlight>Токены в безопасности:</Highlight>
                        <ul className="unordered_list">
                            <li><Highlight>Токены одноразового использования:</Highlight> Одноразовые пароли (OTP), генерируемые для каждой сессии или транзакции.</li>
                            <li><Highlight>JWT (JSON Web Token):</Highlight> Формат токенов, который часто используется для безопасного обмена данными между клиентом и сервером.</li>
                        </ul>
                    </li>
                    <li>
                        <Highlight>Токены в платежах:</Highlight>
                        <ul className="unordered_list">
                            <li><Highlight>Токены для карт:</Highlight> Замена данных банковских карт на уникальный токен, используемый для проведения транзакций.</li>
                            <li><Highlight>Мобильные платежные токены:</Highlight> Используются в системах мобильных платежей, таких как Apple Pay или Google Pay.</li>
                        </ul>
                    </li>
                    <li>
                        <Highlight>Токены в программировании:</Highlight>
                        <ul className="unordered_list">
                            <li><Highlight>Ключевые слова:</Highlight> Например, такие как `if`, `for`, `while`.</li>
                            <li><Highlight>Операторы:</Highlight> Например, `+`, `-`, `=`.</li>
                            <li><Highlight>Идентификаторы:</Highlight> Переменные, функции, классы и другие элементы кода, которые имеют уникальные имена.</li>
                        </ul>
                    </li>
                </ul>
            </Section>

            {/* Преимущества использования токенов */}
            <Section title="Преимущества использования токенов">
                <ul className="unordered_list">
                    <li>
                        <Highlight>Безопасность:</Highlight> Токены заменяют чувствительные данные (например, пароли или номера банковских карт) на временные идентификаторы, что снижает риск утечки данных.
                        *"Использование токенов в платежных системах значительно повышает безопасность транзакций."*
                    </li>
                    <li>
                        <Highlight>Гибкость:</Highlight> Токены могут использоваться в различных системах для аутентификации, авторизации и доступа к ресурсам без необходимости передавать реальные данные.
                        *"OAuth-токены позволяют пользователям безопасно взаимодействовать с API без передачи паролей."*
                    </li>
                    <li>
                        <Highlight>Масштабируемость:</Highlight> В блокчейн-системах токены могут представлять различные активы или права, что делает их универсальными для множества приложений, от финансов до игр и искусства.
                        *"Токенизация активов открывает новые возможности для инвесторов и разработчиков."*
                    </li>
                    <li>
                        <Highlight>Простота интеграции:</Highlight> Многие токенизационные системы легко интегрируются с существующими технологиями, что упрощает их внедрение.
                        *"JWT-токены легко использовать для обеспечения безопасности веб-приложений."*
                    </li>
                </ul>
            </Section>
        </div>
    );
}